app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      artist = Artist.create(name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-07-14 22:45:44.430510"], ["updated_at", "2018-07-14 22:45:44.430510"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-07-14 22:45:44.438480"], ["updated_at", "2018-07-14 22:45:44.438480"]]